import math 

print("введіть перший член прогресії: ")    #запит на введення першого члена
b = float(input())                          #присвоєння значення першого члена прогресії у змінну b
print("введіть знаменник прогресії: ")      #запит на введення знаменника прогресії
q = float(input())                          #присвоєння значення знаменника прогресії у змінну q
print("введіть кількість перших членів: ")  #запит на введення кількості перших членів прогресії
n = int(input())                            #запис кількості перших членів у змінну n

s = (b*(math.pow(q,n)-1))/(q-1)             #обрахування суми і її запис у змінну s

print("Сума перших ", n, " елементів: ",s)  #виведення значення суми
